In [1]:
import pandas as pd
import plotly.express as px
import plotly.graph_objects as go
from dash import Dash, dcc, html, Input, Output

In [ ]:
df=pd.read_csv("household_median_income_2017.csv")
df.dtypes

In [3]:
df.columns.dtype

dtype('O')

In [5]:
df_new=df[['State','2017','2016','2015','2014']]
df_new.head()

           State    2017    2016    2015    2014
0  United States  61,372  60,309  58,476  55,613
1             AL  51,113  48,237  46,053  43,820
2             AK  72,231  77,351  77,717  70,095
3             AZ  61,125  58,328  54,060  51,050
4             AR  48,829  46,894  44,282  46,560

In [ ]:
df_new['2017'] = df_new['2017'].str.replace(',','')
df_new['2017'] = df_new['2017'].astype(int)

In [16]:
df_new.head()

           State   2017    2016    2015    2014
0  United States  61372  60,309  58,476  55,613
1             AL  51113  48,237  46,053  43,820
2             AK  72231  77,351  77,717  70,095
3             AZ  61125  58,328  54,060  51,050
4             AR  48829  46,894  44,282  46,560

In [17]:
#dropping the first unnecessary row
df_new=df_new.drop(labels=0,axis=0)

In [18]:
df_new.head()

  State   2017    2016    2015    2014
1    AL  51113  48,237  46,053  43,820
2    AK  72231  77,351  77,717  70,095
3    AZ  61125  58,328  54,060  51,050
4    AR  48829  46,894  44,282  46,560
5    CA  69759  68,070  65,843  62,693

In [ ]:
#we are going to make our app
app = Dash(__name__)

In [ ]:
#dash.Dash = the application
#dash.dcc = interactive components
#html = html

#create the layout of the application
app.layout = html.Div([
    html.H1("Median Income 2014-2017 by State"),
    dcc.Dropdown(id='year_dropdown',
                options=[
                    {'labels':'2017','value':'2017'},
                    {'labels':'2016','value':'2016'},
                    {'labels':'2015','value':'2015'},
                    {'labels':'2014','value':'2014'}],
                multi=False,
                value='2017',
                style={'width':'40%'}
                ),

    dcc.Graph(id='map',figure={}) 
])
if __name__ == '__main__':
    app.run_server(debug=True)